Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh3808-v3.tmx
Source language: bo
Languages: en

source: །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་ཚུ་རོལ་གྱི་འགྲམ་མམ། ཕ་རོལ་འགྲམ་མམ། གཉིས་ཀ་མ་མཆིས་པ་ལ་ཡང་མི་དམིགས་སོ་ཞེས་བྱ་བ་ཅི་ལས་དགོངས་ཤེ་ན་ཕ་རོལ་ཏུ་སོན་པའམ།
en: Lord, you cannot apprehend the perfection of wisdom of bodhisattva great beings on this side, on the farther side, or on neither.”

source: ཕ་རོལ་གྱི་མཐར་ཕྱིན་པའམ།
en: What does this intend?

source: ཕ་རོལ་གྱི་ངོ་བོ་ཉིད་ལ་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་གྲང་ན།
en: You can suppose “perfection” (pāramitā) is on the way to the other side (para), has arrived at the other side, or is the essential nature of the other side.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡིན་དུ་ཟིན་ཀྱང་། ཚུ་རོལ་གྱི་འགྲམ་ན་ཡང་མི་གནས་ཕ་རོལ་གྱི་འགྲམ་ན་ཡང་མི་གནས་འགྲམ་འདི་གཉིས་ལས་མ་གཏོགས་པ་གཞན་དུ་འང་མི་དམིགས་པའི་ཕྱིར་དེ་སྐད་གསུངས་ཏེ།
en: It says this because, even when taken to be the perfection of wisdom of bodhisattvas, it is not positioned on this side, it is not positioned on the farther side, and cannot be apprehended on some other that is not included in those sides. “

source: ཚུ་རོལ་གྱི་འགྲམ་ཞེས་བྱ་བ་ནི་འདུས་བྱས་སུ་གཏོགས་པའོ། །ཕ་རོལ་གྱི་འགྲམ་ཞེས་བྱ་བ་ནི་འདུས་མ་བྱས་སུ་གཏོགས་པའོ།
en: This side” incorporates the compounded; “the farther side” incorporates the uncompounded.

source: །དེ་སྐད་གསོལ་པ་དང་བཅོམ་ལྡན་འདས་ཀྱིས་ཤིན་ཏུ་རྣམ་པར་དག་པའི་ཕྱིར་རོ་ཞེས་གསུངས་ཏེ།
en: After saying that, “Because it is extremely pure,” said the Lord.

source: གལ་ཏེ་འགྲམ་འགའ་ཞིག་དམིགས་ན་དེ་ལྟ་ན་ནི་རྣམ་པར་དག་པ་ཉིད་དུ་མི་འགྱུར་ཏེ།
en: Were any side to be apprehended, then, in that case, it would not be purity.

source: གང་གི་ཕྱིར་གང་ཡང་མེད་པ་དེའི་ཕྱིར་ཤིན་ཏུ་རྣམ་པར་དག་པ་སྟེ། ཤིན་ཏུ་རྣམ་པར་དག་པ་ཉིད་ཀྱི་ཕྱིར་འགྲམ་གཉིས་དང་། གཞན་ན་ཡང་མི་གནས་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: This means it is extremely pure because there are none, and, because it is extremely pure, it is not positioned on either side or anywhere else either. “

source: །རབ་འབྱོར་དུས་གསུམ་མཉམ་པ་ཉིད་ཀྱི་ཕྱིར་རོ་ཞེས་བྱ་བ་ནི་ཐོག་མ་དང་ཐ་མ་མེད་པའི་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར་དུས་གསུམ་མཉམ་པ་ཉིད་དུ་ཡོངས་སུ་ཤེས་པས་ཚུ་རོལ་གྱི་འདུ་ཤེས་སམ་ཕ་རོལ་གྱི་འདུ་ཤེས་མེད་དེ། དེ་བས་ན་ཚུ་རོལ་གྱི་འགྲམ་ན་ཡང་མི་གནས་ཕ་རོལ་གྱི་འགྲམ་ན་ཡང་མི་གནས་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Because of the sameness of the three time periods, Subhūti”— this means that with the comprehension of the sameness of the three time periods, because of the emptiness of no beginning and no end, there is no notion of this side and no notion of a farther side, and hence “it does not stand on this side and it also does not stand on the farther side.”

source: །དམིགས་པ་དང་མི་དམིགས་པར་སྤྱོད་པའི་དབང་གིས་ཟབ་པར་ཡིད་ཆེས་པར་བྱ་བའི་ཕྱིར། དེའི་འོག་ཏུ་ཆགས་པ་དང་། མ་ཆགས་པ་བཤད་པའི་སྐབས་ཕྱེ་བ་ཡང་མིང་དུ་ཡང་ཆགས་པ་ཡིན། མཚན་མར་ཡང་ཆགས་པ་ཡིན་ནོ་ཞེས་བྱ་བ་ལ་སོགས་པ་སྟེ།
en: Attachment and nonattachment In order to build trust that the perfection of wisdom is deep, it then again sets the scene for the explanation of attachment and nonattachment from the perspective of practices that apprehend and do not apprehend, with “they are attached to a name and attached to a causal sign,” and so on.

source: གཟུགས་ལ་སོགས་པའི་ཆོས་རྣམས་ལ་མིང་དུ་འཛིན་པ་ནི་ཀུན་བརྟགས་པའོ།
en: Seizing on a dharma, form and so on, as a word is falsely imagining.

source: །བརྡ་ལ་མཚན་མར་འཛིན་པ་ནི་རྣམ་པར་བརྟགས་པ་སྟེ།
en: Seizing on a causal sign as a conventional term is conceptualizing.

source: གཉི་ག་ཡང་སྒྲིབ་པའི་བདག་ཉིད་ཡིན་པས་ཆགས་པ་ཞེས་བྱའོ།
en: Both are obscurations, so they are “attachment.” “

source: །རབ་འབྱོར་ཆོས་ཐམས་ཅད་ནི་མཚན་མ་མེད་པ་སྟེ། མིང་མེད་པའོ་ཞེས་བྱ་བ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྤྱོད་ཡུལ་ཡིན་པར་བསྟན་པའོ།
en: Subhūti, even though all dharmas are without causal signs and without names” is teaching that they are within the range of the perfection of wisdom. “

source: །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་དེ་ལྟར་ལེགས་པར་བཤད་ཅིང་ལེགས་པར་མཐར་གཏུགས་པ་ནི་ངོ་མཚར་ཆེའོ་ཞེས་བྱ་བ་ནི་ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་བསྟན་པའོ།
en: Lord, such an excellent exposition and excellent definitive teaching of this perfection of wisdom… to bodhisattva great beings is amazing”— this is teaching of the knowledge of path aspects. “

source: །གཟུགས་སྟོང་ཞེས་བྱ་བར་འདུ་ཤེས་ན་ཆགས་པའོ་ཞེས་བྱ་བ་ནི་དམིགས་པའི་ཚུལ་གྱིས་དེ་ལྟར་སེམས་པའོ།
en: When… they perceive that form is ‘empty,’ they are attached” is thinking like that by way of apprehending something. “

source: །གཟུགས་ལ་གཟུགས་ཞེས་བྱ་བར་འདུ་ཤེས་མེད་དོ་ཞེས་བྱ་བ་ནི་བྱང་ཆུབ་སེམས་དཔའི་ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་དོ།
en: Not perceive form as ‘form’ ”— this is the bodhisattva’s knowledge of path aspects. “

source: །ཆོས་རྣམས་ལ་ཆོས་ཞེས་བྱ་བར་འདུ་ཤེས་འདུ་ཤེས་མེད་དོ་ཞེས་བྱ་བ་ནི་མི་སྣང་བའོ།
en: Not perceive… dharmas as… ‘dharmas’ ”— they do not appear. “

source: །ཀཽ་ཤི་ཀ་གཟུགས་ཀྱི་རང་བཞིན་ཡོངས་སུ་བསྔོ་བར་མི་ནུས་སོ་ཞེས་བྱ་བ་ནི་ཆོས་རྣམས་གནས་པའི་མཚན་ཉིད་ཡིན་པའི་ཕྱིར་ཡོངས་སུ་འགྱུར་བ་མེད་པས་དམིགས་པའི་ཚུལ་གྱིས་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་བར་མི་བྱའོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Kauśika, it is because the basic nature of form cannot be dedicated” means dharmas should not be dedicated to awakening by way of apprehending something, because they stay in the same state and do not undergo transformation. “

source: །རབ་འབྱོར་ཁྱོད་ལ་ཆགས་པའི་རྣམ་པ་དེ་བས་ཀྱང་ཕྲ་བ་གཞན་དག་ཀྱང་བསྟན་པར་བྱ་ཞེས་བྱ་བ་ནི་ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་ལ་སྒྲིབ་པར་འགྱུར་བའོ།
en: Subhūti, I will teach you other sorts of attachment even more subtle than those” that obscure the knowledge of path aspects. “

source: །བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་ཟབ་པོ་ཞེས་བྱ་བ་ནི་སྔར་གནས་བརྟན་ཤཱ་རིའི་བུས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཟབ་པ་དང་། མོས་པར་དཀའ་བར་ཡིད་ཆེས་པར་བྱ་བའི་ཕྱིར་བཤད་པའི་སྐབས་ཕྱེ་བས།
en: Lord, the perfection of wisdom is deep.” Earlier, to build trust, the elder Śāriputra set the scene for the explanation of the perfection of wisdom being deep, and for it being hard to believe in.

source: ད་ནི་གནས་བརྟན་རབ་འབྱོར་གྱིས་བདག་ཉིད་ཀྱིས་ཟབ་མོ་ཁོང་དུ་ཆུད་པ་བསྟན་པའི་ཕྱིར། བཅོམ་ལྡན་འདས་ཟབ་པོ་ཞེས་བྱ་བ་གསུངས་སོ།
en: Now, to demonstrate that he himself has comprehended that it is deep, the elder Subhūti says, “Lord, … [it] is deep.” “

source: །རབ་འབྱོར་ཆོས་ཐམས་ཅད་རང་བཞིན་གྱིས་རྣམ་པར་དབེན་པའི་ཕྱིར་རོ་ཞེས་བྱ་བ་ནི་འདི་ལྟར་ཆོས་ཐམས་ཅད་ནི་དུས་ཐམས་ཅད་དུ་ཆགས་པ་ཐམས་ཅད་ཡོངས་སུ་སྤངས་པ།
en: Subhūti, it is because all dharmas are isolated in their basic nature.” Thus all phenomena are always deserted by all attachments, are deserted by a basic nature, are isolated in their basic nature.

source: རང་བཞིན་ཡོངས་སུ་སྤངས་པ་རང་བཞིན་གྱིས་དབེན་པ་ཡིན་ན། འོན་ཀྱང་ཀུན་བརྟགས་པའི་ཆགས་པ་ཡང་དམིགས་ལ་ཀུན་བརྟགས་པའི་ཆགས་པ་དམིགས་ཀྱང་ཆོས་ཐམས་ཅད་ནི་ངོ་བོ་ཉིད་ཀྱིས་གོས་པ་མེད་པ་སྟེ་དབེན་པའི་ཕྱིར་ཟབ་པའོ།
en: But falsely imagined attachment is still apprehending, and even though falsely imagined attachment is apprehending, still all dharmas are untainted, that is, are isolated in their intrinsic nature so they are deep. “

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་མ་བྱས་པ་མངོན་པར་འདུས་མ་བྱས་པ་ཞེས་བྱ་བ་ནི།
en: The perfection of wisdom… is unmade and does not cause anything to come into being.”

source: ཆོས་ཀྱི་སྐུའི་ངོ་བོ་ཉིད་ཡིན་པའི་ཕྱིར་དེ་ལ་བསྒྲུབ་པར་བྱ་བ་འམ་མངོན་པར་འདུ་བྱ་བ་མེད་དོ།
en: In it there is nothing to be established and nothing is caused to come into being because it is the intrinsic nature of the dharma body. “

source: །ཆོས་ཀྱི་རང་བཞིན་ནི་གཉིས་མ་ཡིན་ཏེ།
en: The basic nature of a dharma is not two; it is simply one.”

source: གཅིག་ཏུ་ཟད་དོ་ཞེས་བྱ་བ་ནི་དེ་བཞིན་ཉིད་ཀྱི་ངོ་བོ་ཉིད་དུ་ཆོས་ཐམས་ཅད་ངོ་བོ་ཉིད་གཅིག་ན་འོན་ཀྱང་བདག་ཉིད་ཐ་དད་པར་སྣང་བའི་ཕྱིར།
en: As the intrinsic nature that is suchness, all dharmas are a single entity, but still they appear with different identities.

source: མངོན་པར་རྟོགས་པར་དཀའ་བའོ།
en: This is difficult to clearly realize.

source: །དེ་བཞིན་ཉིད་ཆོས་རྣམས་ཀྱི་ངོ་བོ་ཉིད་ཡིན་པའི་ཕྱིར་རང་བཞིན་ཞེས་བྱའོ།
en: Because suchness is the intrinsic nature of all dharmas it is called their “basic nature.”

source: །དེ་བཞིན་ཉིད་དེ་ཡང་ཆོས་ཉིད་གཞན་གང་གི་རྒྱུ་ཡང་མ་ཡིན་པའི་ཕྱིར་རང་བཞིན་མ་ཡིན་ནོ་ཞེས་བྱའོ།
en: That suchness, moreover, is not the cause of any other true nature of dharmas, so it “is not a basic nature.”

source: །དེ་བཞིན་ཉིད་དེ་འདུས་མ་བྱས་པའི་ཕྱིར་སུས་ཀྱང་མ་བྱས་པས་མ་བྱས་པ་ཞེས་བྱའོ།
en: This suchness is uncompounded; it is not made by anybody, so it “is unmade.”

source: །དེ་ཉིད་བསོད་ནམས་དང་བསོད་ནམས་མ་ཡིན་པ་མངོན་པར་འདུ་བྱེད་པ་གང་གིས་ཀྱང་མངོན་པར་འདུ་མ་བྱས་པའི་ཕྱིར། མངོན་པར་འདུ་མ་བྱས་པ་ཞེས་བྱའོ།
en: Just that “has not caused anything to come into being” because no enactment of merit or demerit whatsoever has occasioned it. “

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་སུས་ཀྱང་མ་མཐོང་མ་ཐོས་མ་རྟོགས་རྣམ་པར་མ་ཤེས་ཞེས་བྱ་བ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་དམིགས་པ་དང་། དམིགས་པར་བྱ་བ་མཉམ་པའི་ངོ་བོ་ཉིད་ཡིན་པའི་ཕྱིར་མཐོང་བ་ལ་སོགས་པའི་རྣམ་པར་ཤེས་པ་རྣམ་པར་རྟོག་པ་དང་བཅས་པ་དེ་ལྟ་བུ་དག་གི་སྤྱོད་ཡུལ་དུ་གྱུར་པ་མ་ཡིན་པའི་ཕྱིར་རོ།
en: Nobody has seen, heard, thought about, been conscious of, or fully awakened to the perfection of wisdom,” because the perfection of wisdom is not the object of seeing consciousness and so on, nor of thought constructions such as those, because an apprehender and an apprehended object are the same in their intrinsic nature. “

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་བསམ་གྱིས་མི་ཁྱབ་པའོ་ཞེས་བྱ་བ་ནི་དུ་བས་མེ་མཚོན་པ་ལྟར། ཆོས་གཞན་གྱིས་བསམ་དུ་མི་ནུས་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: The perfection of wisdom is inconceivable” means you cannot conceive of it through another dharma, like fire indicated by smoke.

source: །དེ་བས་ན་གཟུགས་ཀྱིས་མ་ཤེས་སོ་ཞེས་བྱ་བ་ལ་སོགས་པ་གསུངས་སོ།
en: Therefore, it says “it is not known through form” and so on.

source: །ཆོས་ཐམས་ཅད་དམིགས་སུ་མེད་པར་བྱེད་པའོ་ཞེས་བྱ་བ་ནི་ཆོས་ཐམས་ཅད་དམིགས་སུ་མེད་པའི་མཚན་ཉིད་དུ་ཤེས་པར་བྱེད་པའོ།
en: It “is the nonapprehender of all dharmas.” It makes all dharmas known as the mark of what cannot be apprehended.

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་ཇི་ལྟར་སྤྱད་པར་བགྱི་ཞེས་བྱ་བ་ནི་ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་ལའོ།
en: Explanation of Chapters 37 and 38 “How do [they]… practice the perfection of wisdom?” that is, the knowledge of path aspects.

source: །རང་བཞིན་ཤེས་པས་ཆོས་ཐམས་ཅད་ལ་སྤྱོད་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་མ་ཡིན་ནོ་ཞེས་བསྟན་པའི་ཕྱིར། གཟུགས་ལ་མི་སྤྱོད་ན་ཞེས་བྱ་བའི་འགྲེས་སོ།
en: The section of the text to teach that if those conscious of a basic nature practice all dharmas they do not practice the perfection of wisdom is “if they do not practice form,” and so on.

source: །ལྷག་མཐོང་གི་ཤེས་པས་ཆོས་ཀྱི་མཚན་ཉིད་ལ་སྤྱོད་ན་སྤྱོད་པ་མ་ཡིན་ནོ་ཞེས་བྱ་བ་བསྟན་པའི་ཕྱིར་འགྲེས་གཉིས་པའོ།
en: The second section is to teach that when those conscious of special insight practice the marks of dharmas, they do not practice the perfection of wisdom.

source: །གཟུགས་ཡོངས་སུ་རྫོགས་པའམ་ཡོངས་སུ་མ་རྫོགས་པ་ཞེས་བྱ་བ་ནི་སྒོམ་པ་ཡོངས་སུ་རྫོགས་པ་ལས་དགོངས་ཏེ་གསུངས་པའོ།
en: It says, “ ‘form is completed’ or ‘not completed,’ ” intending when meditation is completed. “ ‘

source: །གཟུགས་མ་ཆགས་པ་ཞེས་བྱ་བ་ནི་ཆོས་ཉིད་ཀྱི་གཟུགས་སྒྲིབ་པ་མེད་པའོ།
en: Form is not attached’ ” is the unobstructed true dharmic nature of form.

source: །དེ་ལྟར་སྤྱོད་ན་གཟུགས་ཆགས་པ་མེད་པ་ཞེས་བྱ་བར་འདུ་ཤེས་པ་མེད་དོ་ཞེས་བྱ་བ་ནི་སྒྲུབ་པའི་ཚེ་དེ་ལྟར་ཞུགས་ན་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཁོང་དུ་ཆུད་པའི་ཚེ་དེ་ལྟར་རབ་ཏུ་རྟོགས་པ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ། །རབ་འབྱོར་ངོ་མཚར་དུ་གྱུར་པའི་ཚིག་དང་།
en: When they practice like that “they do not perceive ‘form is not attached.’ ” This means that if, when practicing, they have set out like that, then when they awaken to the knowledge of all aspects they will have a realization like that.

source: དགེ་སློང་ཞིག་གི་ཚིག་དང་། བརྒྱ་བྱིན་གྱི་ཚིག་དང་། བསྲུང་བ་དང་བསྐྱབ་པ་དང་། སྦ་བ་དང་། མི་ནུས་པའི་ཚིག་རྣམས་ནི་ཐམས་ཅད་ཀྱང་འདྲའོ།
en: Benefits of purity Subhūti’s statement that he is amazed, the statement of some monk or other, the statement by Śatakratu, and the statement that guarding, protecting, and keeping safe are not possible are all alike. “

source: །གཟུགས་རློམ་སེམས་སུ་མི་བྱེད་ཅེས་བྱ་བ་ནི་བྱེད་པ་དང་། མཚན་ཉིད་ལ་སོགས་པའི་དངོས་པོར་རོ། །གཟུགས་བདག་གི་ཞེས་བྱ་བར་རློམ་སེམས་སུ་མི་བྱེད་དོ་ཞེས་བྱ་བ་ནི་རྗེ་ཁོལ་གྱི་དངོས་པོར་རོ། །གཟུགས་ལ་རློམ་སེམས་སུ་མི་བྱེད་ཅེས་བྱ་བ་ནི་གནས་དང་རྟེན་པའི་དངོས་པོར་རོ། །གཟུགས་ཀྱི་མཚན་མར་ཡང་རློམ་སེམས་སུ་མི་བྱེད་ཅེས་བྱ་བ་ནི་བརྡར་བཏགས་པའི་དངོས་པོར་རོ།
en: They do not falsely project form” as a functioning thing that is real and a defining mark and so on; “do not falsely project form as ‘mine’ ” as a real thing, like a master’s servant; “do not falsely project anything onto form” as a real thing on a foundation or basis; and “do not falsely project a causal sign of form” as a basis of a designation that is a conventional term.

source: །སངས་རྒྱས་སྟོང་བསྟན་པ་ནི་དེ་དག་དེ་ལ་དད་པའི་ཕྱིར་རོ།
en: The description of “the thousand buddhas” is because those thousand buddhas cause faith to arise in that perfection of wisdom.

source: །བྱམས་པས་ཆོས་བཤད་པ་ཞུས་པའི་དུས་གསུམ་ཆར་དུ་ཡུན་འདི་ཉིད་བཤད་པར་ཤེས་པར་བྱ་བའི་ཕྱིར་རོ།
en: The question about “Maitreya” teaching the Dharma is to make it known that during the three periods of time the explanations are of just this perfection of wisdom.

source: །དེའི་འོག་ཏུ་རབ་འབྱོར་གཟུགས་ཡོངས་སུ་དག་པའི་ཕྱིར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་དག་པའོ་ཞེས་བྱ་བ་ནི་གཟུགས་ལ་སོགས་པའི་ཆོས་དམིགས་པར་གྱུར་པ་རྣམས་དྲི་མ་མེད་པར་གྱུར་པས་ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་དེ་ཡང་རྣམ་པར་དག་པར་འགྱུར་རོ།
en: Then, “Subhūti, the perfection of wisdom is pure because form is pure.” The dharmas, form and so on, that have been apprehended are stainless, so the knowledge of path aspects is also pure. “

source: །རབ་འབྱོར་གཟུགས་ལ་སྐྱེ་བ་མེད་པ་དང་། འགག་པ་མེད་པ་དང་ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ་དང་།
en: Subhūti, form… is unproduced and unceasing, without defilement and without purification.”

source: རྣམ་པར་བྱང་བ་མེད་པ་ཞེས་བྱ་བ་ནི་གང་གི་ཚེ་གཟུགས་ཆོས་ཉིད་ཀྱི་རང་བཞིན་དུ་གནས་གྱུར་ནས་སྐྱེ་བ་དང་འགག་པ་དང་ཀུན་ནས་ཉོན་མོངས་པ་དང་། རྣམ་པར་བྱང་བར་མི་སྣང་བ་དེའི་ཚེ་གཟུགས་དེ་ཡོངས་སུ་དག་པ་ཞེས་བྱའི་གཞན་དུ་ནི་མ་ཡིན་ནོ།
en: When form abides in its intrinsic nature—the true nature of dharmas—and does not appear as produced, ceasing, defiled, or purified, that “form is pure,” not otherwise. “

source: །ནམ་མཁའ་ཡོངས་སུ་དག་པའི་ཕྱིར་ཞེས་བྱ་བ་ནི་ཇི་ལྟར་ནམ་མཁའ་ལ་གློ་བུར་གྱི་སྤྲིན་དང་ཁུག་རྣ་ཡོད་ཀྱང་དེ་རང་བཞིན་གྱིས་དག་པའི་ཕྱིར་ཡོངས་སུ་དག་པ་མ་ཡིན་པར་མི་འགྱུར་ཏེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡང་དེ་བཞིན་ནོ་ཞེས་བསྟན་པའོ། །ཡོངས་སུ་དག་པ་དང་གོས་པ་མེད་པ་དང་།
en: Because space is pure”— this is teaching that just as space does not become impure even if there are clouds and haze because it is pure in its nature, so too with the perfection of wisdom.

source: འཛིན་པ་མེད་པ་དང་། སྨྲ་བ་མེད་པ་དང་། རབ་ཏུ་བརྗོད་པ་མེད་པ་དང་། དམིགས་སུ་མེད་པའི་ཕྱིར་རྣམ་པ་དྲུག་གིས་ནམ་མཁའ་དང་མཚུངས་པར་བསྟན་ཏོ།
en: The six— “pure… untainted… cannot be grasped… does not say anything… does not converse about anything… cannot be apprehended”— teach that it is comparable to space. “

source: །ནམ་མཁའ་སྨྲ་བ་མེད་པའི་ཕྱིར་ཞེས་བྱང་ནི་ནམ་མཁའ་ལ་དེ་ལས་གཞན་པ་རྣམས་སྨྲ་ཡང་། ནམ་མཁའ་ལ་ནི་སྨྲ་བའམ། མངོན་པར་བརྗོད་པ་མེད་དོ། །དཔེར་ན་ནམ་མཁའ་ལ་བྲག་ཅ་གཉིས་ཀྱི་སྒྲ་གྲག་ཀྱང་། ནམ་མཁའ་ནི་སྨྲ་བ་དང་བཅས་པའོ་ཞེས་བརྗོད་དུ་མི་རུང་བ་ལྟ་བུའོ།
en: Because space does not say anything”— even though in space something other than that space says something, in space nothing is said and there is no conversation, “just like the two sounds of an echo, as an analogy,” reverberate in space, but it is not suitable to say that space says something. “

source: །ནམ་མཁའ་རབ་ཏུ་བརྗོད་པ་མེད་པའི་ཕྱིར་ཞེས་བྱ་བ་ནི་ནམ་མཁའ་ལ་ངོ་བོ་ཉིད་ཀྱིས་རབ་ཏུ་བརྗོད་པ་མེད་དོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Because space does not converse about anything” means that because of its intrinsic nature there is no conversation in space.

source: །ཡང་སྒྲ་ཙམ་ནི་སྨྲ་བའོ། །མངོན་པར་བརྗོད་པའི་རབ་ཏུ་བརྗོད་པའོ། །རབ་འབྱོར་གཟུགས་ཤིན་ཏུ་རྣམ་པར་དག་པ་དང་། དམིགས་སུ་མེད་པ་དང་། སྐྱེ་བ་མེད་པ་དང་།
en: Alternatively, “saying something” is mere sound; “conversing” is naming. “

source: འགག་པ་མེད་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ་དང་། རྣམ་པར་བྱང་བ་མེད་པའི་ཕྱིར་ཞེས་བྱ་བ་ནི་གང་གི་ཚེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདིས་ཆོས་ཐམས་ཅད་མཐོང་སྟེ། གཟུགས་ལ་སོགས་པའི་ཀུན་བརྟགས་པའི་ཉོན་མོངས་པ་དང་། རྣམ་པར་རྟོག་པ་སྤྲོས་པའི་དྲི་མ་མེད་པའི་ཕྱིར།
en: Subhūti, … because form is extremely pure, cannot be apprehended, is unproduced and unceasing, and without defilement and without purification”— when this perfection of wisdom sees all dharmas, it sees the “pure” aspect of form and so on because the stains of falsely imagined afflictions and conceptualizations constructed in thought do not exist; the aspect that “cannot be apprehended” because it is separated from all apprehending; the “unproduced and unceasing” aspects because it is a thoroughly established phenomenon; and the aspects “without defilement and without purification” because it is isolated from an intrinsic nature.

source: རྣམ་པར་དག་པའི་རྣམ་པ་དང་། དམིགས་པ་ཐམས་ཅད་དང་བྲལ་བའི་ཕྱིར། དམིགས་སུ་མེད་པའི་རྣམ་པ་དང་། ཡོངས་སུ་གྲུབ་པའི་ཕྱིར་སྐྱེ་བ་མེད་པ་དང་།
en: At that point it is called “pure” in its nature.

source: འགག་པ་མེད་པའི་རྣམ་པ་དང་། རང་བཞིན་གྱིས་དབེན་པའི་ཕྱིར་ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ་དང་། རྣམ་པར་བྱང་བ་མེད་པའི་རྣམ་པར་མཐོང་བ་དེའི་ཚེ་བདག་ཉིད་ཡོངས་སུ་དག་པ་ཞེས་བྱ་བའི་མིང་དུ་འགྱུར་རོ། །དེ་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཤིན་ཏུ་ཡོངས་སུ་དག་པར་བསྟན་ནས། དེའི་འོག་ཏུ་འདི་ལ་དད་པ་བསྐྱེད་པའི་ཕྱིར་དེ་ལ་མིག་གི་ནད་འབྱུང་བར་མི་འགྱུར་རོ་ཞེས་བྱ་བ་ལ་སོགས་པས་ཚེ་འདི་དང་ཚེ་ཕྱི་མ་ལ་འབྱུང་བའི་ཕན་ཡོན་རྣམས་བསྟན་ཏོ།
en: Having thus taught that the perfection of wisdom is extremely pure, then, to engender faith in it, they “will not contract diseases of the eye,” and so on, teaches its benefits in the here and now and in future lives. “

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་ནི་སྐྱེ་བའམ་འགག་པའམ་ཀུན་ནས་ཉོན་མོངས་པའམ། རྣམ་པར་བྱང་བའམ། ཡོངས་སུ་བཟུང་བ་འམ་དོར་བའི་ཆོས་གང་ཡང་མེད་དོ་ཞེས་བྱ་བ་ནི་སྐྱེ་བ་དང་འགག་པ་ལ་སོགས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་མི་སྣང་ངོ་ཞེས་བསྟན་པའོ།
en: In the perfection of wisdom there is no dharma that is produced or ceases, is defiled or purified, or is appropriated or rejected at all” teaches that production, cessation, and so on do not appear in the perfection of wisdom. “

source: །དེ་ལྟར་འདུ་ཤེས་པར་ཡང་མི་བྱེད་ལ་དེ་ལྟར་མི་རྟོག་ཅིང་ཞེས་བྱ་བ་ནི་དེ་ལྟར་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་རིན་པོ་ཆེ་ཡོན་ཏན་མང་པོ་དང་ལྡན་པ་ཡིན་ནོ་སྙམ་དུ་ཡང་མི་རྟོག་པའོ། །རབ་འབྱོར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་ནི་ཆོས་གང་ཡང་སྒྲུབ་པའམ་རྣམ་པར་སྟོན་པ་མ་ཡིན་ཞེས་བྱ་བ་ནི་ཆོས་ཐམས་ཅད་མི་འགྱུར་བར་ཡོངས་སུ་འགྲུབ་པས་ཡོངས་སུ་གྲུབ་པ་དེའི་ཚེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་དེ་ལྟར་སྣང་སྟེ། ཆོས་ཁྱད་པར་ཅན་གང་ཡང་བསྒྲུབ་པར་བྱའོ་སྙམ་པའི་རློམ་སེམས་ཀྱང་མེད། ཆོས་ཁྱད་པར་ཅན་རྣམས་ཀྱང་བཟུང་ངོ་སྙམ་མམ། སྦྱིན་ནོ་སྙམ་པའི་རློམ་སེམས་ཀྱང་མེད། ཟག་པ་མེད་པའི་ཆོས་རྣམས་བསྐྱེད་དོ་སྙམ་མམ་ཆོས་ངན་པ་རྣམས་དག་གོ་སྙམ་པའི་རློམ་སེམས་ཀྱང་མེད། འཁོར་བའི་ཆོས་རྣམས་རྒྱུན་བཅད་དོ་སྙམ་མམ།
en: Thus, do not form a notion, and thus do not conceive”— they do not even conceive of the perfection of wisdom as such “a great jewel” endowed with those good qualities. “

source: རྣམ་པར་བྱང་བ་རྣམས་བརྟག་པར་བྱའོ་སྙམ་པའི་རློམ་སེམས་ཀྱང་མེད། བདག་ནི་གཅིག་གོ་སྙམ་པའམ་ཐ་དད་དོ་སྙམ་པའི་རློམ་སེམས་ཀྱང་མེད། བདག་ནི་སྔོན་མ་བྱུང་བ་ལས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་སྟོབས་ཀྱིས་བྱུང་བ་སྟེ།
en: Subhūti, this perfection of wisdom does not establish any dharma, or teach it.”

source: སྒྲིབ་པ་ཐམས་ཅད་བྲལ་བའོ་སྙམ་པའི་རློམ་སེམས་ཀྱང་མེད། སྔོན་ཉོན་མོངས་པ་དང་ཉེ་བའི་ཉོན་མོངས་པ་ལ་སོགས་པས་ཀུན་ནས་ཉོན་མོངས་པར་གྱུར་པ་ལས། ཕྱིས་རྣམ་པར་དག་གོ་སྙམ་པའི་རློམ་སེམས་ཀྱང་མེད། ནག་པོའི་ཆོས་རྣམས་འགྲིབ་པར་བྱ་ཞིང་དཀར་པོའི་ཆོས་རྣམས་རྣམ་པར་འཕེལ་བར་བྱའོ་སྙམ་པའི་རློམ་སེམས་ཀྱང་མེད། དུས་གསུམ་དུ་གཏོགས་སོ་སྙམ་པའི་རློམ་སེམས་ཀྱང་མེད། ཁམས་གསུམ་དུ་དགོད་དོ་སྙམ་པའམ། ཡང་དག་པར་བཟླ་བར་བྱའོ་སྙམ་པའི་རློམ་སེམས་ཀྱང་མེད། བདག་ནི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སོགས་པ་སྦྱིན་པར་བྱེད་པའམ། དེའི་མི་མཐུན་པའི་ཕྱོགས་སེར་སྣ་ལ་སོགས་པ་སྤོང་བར་བྱེད་པའོ་སྙམ་པའི་རློམ་སེམས་ཀྱང་མེད་དོ།
en: All dharmas are thoroughly established phenomena that do not alter, so at the time they are thoroughly established phenomena this perfection of wisdom appears like that, which is to say, there is no false projection of having to establish any special dharma; there is no false projection of taking hold of or bestowing any special dharma; there is no false projection of producing dharmas without outflows or stopping bad dharmas; there is no false projection of annihilating the dharmas of cyclic existence or of making purification permanent; there is no false projection of being one or being different things; there is no false projection of coming about through the power of bodhisattva activities not there before or being separated from all obscurations; there is no false projection of having earlier become defiled by afflictions, secondary afflictions, and so on, and later being purified; there is no false projection of making dark dharmas decline and making bright dharmas increase; there is no false projection of being included in the three periods of time; there is no false projection of being established in the three realms or of having to transcend them; and there is no false projection of bestowing the perfection of giving and so on, or of removing their opposing sides of miserliness and so on. “

source: །རབ་འབྱོར་དེ་བཞིན་གཤེགས་པ་རྣམས་བྱུང་ཡང་རུང་མ་བྱུང་ཡང་རུང་ཞེས་བྱ་བ་ནི་ཆོས་ཐམས་ཅད་གནས་པའི་མཚན་ཉིད་དེ། གང་ཡང་ཅི་ཡང་མི་བྱེད་དོ་ཞེས་བསྟན་པའོ།
en: Subhūti, whether the tathāgatas arise or whether the tathāgatas do not arise” is teaching the mark of all dharmas that remain in the same state, nothing doing anything at all.

source: །ཆོས་གནས་པ་འདི་ཉིད་མཁྱེན་པས། དེ་བཞིན་གཤེགས་པ་ཞེས་བྱ་བ་དག་འཇིག་རྟེན་ན་སྣང་སྟེ།
en: Those “tathāgatas,” so called because they know just this state in which dharmas remain, appear in the world.

source: འདི་ཉིད་དེ་དག་གི་མངོན་པར་རྟོགས་པ་དང་། འདི་ཉིད་ཆོས་ཀྱི་འཁོར་ལོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: It means just this is their clear realization, just this is “the wheel of Dharma.” “

source: །རབ་འབྱོར་འདི་ནི་ཆོས་ཀྱི་འཁོར་ལོ་གཉིས་སུ་བསྐོར་བ་ཡང་མ་ཡིན།
en: Subhūti… it is not a second turning of the wheel of Dharma and it is not a first turning either.”

source: གཅིག་ཏུ་བསྐོར་བ་ཡང་མ་ཡིན་ནོ་ཞེས་བྱ་བ་ནི་དོན་དམ་པར་ཆོས་ཐམས་ཅད་གྲངས་ལས་འདས་པའི་ཕྱིར་དེ་སྐད་བསྟན་ཏོ།
en: It says this because ultimately all dharmas are beyond counting.

source: །ཆོས་གང་ཡང་བསྐོར་བའམ་མི་བསྐོར་བར་བྱ་བའི་ཕྱིར་ཉེ་བར་གནས་པ་མ་ཡིན་ནོ་ཞེས་བྱ་བ་ནི་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་རོ་ཞེས་བྱ་བའི་འདུ་ཤེས་སམ། རྣམ་པར་རྟོག་པ་སེལ་བར་བྱེད་པའོ།
en: It “has not been made available in order to turn or not turn any Dharma” removes the notion or idea that it is turning or not turning the wheel of Dharma. “

source: །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར་རོ་ཞེས་བྱ་བ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་ཆོས་ཐམས་ཅད་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་ཀྱི་མཚན་ཉིད་དུ་འཛིན་ཏོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Given the emptiness that is the nonexistence of an intrinsic nature” means the perfection of wisdom grasps all dharmas as the mark of the emptiness that is the nonexistence of an intrinsic nature. “

source: །ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་ནི་ཆེན་མོ་སྟེ་ཞེས་བྱ་བ་ལ་སོགས་པ་ཚིག་དགུ་བཅུ་རྩ་ལྔས་གནས་བརྟན་རབ་འབྱོར་གྱིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་ཆོས་ཐམས་ཅད་ལ་འཇུག་པ་རྒྱ་ཆེར་སྟོན་ཏེ།
en: The perfection of wisdom is a great perfection,” and so on. With the ninety-five statements the elder Subhūti explains at length that this perfection of wisdom engages with all dharmas.

source: དེ་ལ་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་ནི་ཆེན་པོ་ཞེས་བྱ་བ་ནི་ཡུལ་ཆེ་བ་དང་། གསང་བ་ཆེན་པོ་ཡུལ་དུ་གྱུར་པ་སྟོན་ཏེ།
en: There “the perfection of wisdom is a great perfection” teaches that it is a great object, and a great secret in the form of an object.

source: འདི་ལྟར་གསང་བ་ནི་གསུམ་སྟེ་ཆོས་འཇུག་པ་གསང་བ་དང་། མངོན་པར་བྱང་ཆུབ་པ་གསང་བ་དང་། ཆོས་ཉིད་ཀྱི་འཁོར་ལོ་བསྐོར་བ་གསང་བའོ།
en: It says about such a secret that it is three: a secret engagement with dharmas, a secret awakening, and a secret turning of the wheel of Dharma.
